//Од стандарден влез се читаат непознат број на хексадецимални цифри се додека не се внесе точка (.).
//Ваша задача е да го пресметате декадниот збир на внесените хексадецимални цифри.
//Доколку добиениот декаден збир е делив со 16 се печати Pogodok.
//Доколку истиот тој збир покрај што е делив со 16 плус завршува на 16 (последните цифри му се 1 и 6),
//се печати Poln pogodok инаку се печати самиот збир.
//
//Пример:
//
//влез: A 7 F 2 0 c A 5
//
//излез: 61
//
//(61 = 10 + 7 + 15 + 2 + 0 + 12 + 10 + 5, бројот не е делив со 16, ниту пак последните цифри му се 1,6)

#include <stdio.h>

int main()
{
    int zbir=0;
    char c;
    while(c=getchar()){
        if(c=='.') break;
        if(c==49) zbir+=1;
        if(c==50) zbir+=2;
        if(c==51) zbir+=3;
        if(c==52) zbir+=4;
        if(c==53) zbir+=5;
        if(c==54) zbir+=6;
        if(c==55) zbir+=7;
        if(c==56) zbir+=8;
        if(c==57) zbir+=9;
        if(c=='A'||c=='a') zbir+=10;
        if(c=='B'||c=='b') zbir+=11;
        if(c=='C'||c=='c') zbir+=12;
        if(c=='D'||c=='d') zbir+=13;
        if(c=='E'||c=='e') zbir+=14;
        if(c=='F'||c=='f') zbir+=15;
        if(c==0) zbir+=0;
    }

    if(zbir%16==0&&zbir%100==16) printf("Poln pogodok");
    else if(zbir%16==0) printf("Pogodok");
    else printf("%d", zbir);

    return 0;
}