//Од стандарден влез се внесуваат непознат број на реченици претставени преку текстуални низи (стрингови)
//секоја не подолга од 100 знаци и секоја во нов ред. Програмата треба да го најде стрингот кој содржи најмногу сврзници
//и да го испечати заедно со бројот на најдените сврзници. За сврзници се сметаат сите зборови составени од една, две или три букви.
//Зборовите во текстуалната низа се одделени со едно или повеќе прзани места и/или интерпункциски знак.
//
//Броењето на сврзници во дадена текстуална низа треба да се реализира во посебна функција.
//Решенијата без користење функција ќе бидат оценети со најмногу 40% од поените.
//
//Ако има повеќе реченици со ист максимален број на сврзници, се печати прво најдената.
//Објаснување на тест примерот:
//Бројот на сврзници по реченици е 2, 3, 4, 2, 4 и 7 соодветно. Најмногу сврзници има по последната реченица па се печати
//бројот 7 и содржината на таа реченица.

#include <stdio.h>
#include <string.h>
#include <ctype.h>

int svrznici (char c[]){
    int brojach=0, kraj=0, i=0, br;
    br=strlen(c);
    for(i=0; i<br; i++){
        if(isalpha(c[i])){
            brojach++;
        }
        if(isspace(c[i])||ispunct(c[i])){
            if(brojach<4&&brojach!=0){
                kraj++;
            }
            brojach=0;
        }
    }
    return kraj;
}

int main(){
    int broj=0, k;
    char c[100], a[100];
    while(fgets(c, sizeof(c), stdin)){
        c[strlen(c)-1]='\0';
        k=svrznici(c);
        if(k>broj){
            broj=k;
            strcpy(a, c);
        }
    }
    printf("%d: %s", broj, a);
    return 0;
}