//Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.
//Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.
//Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број,
//во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.
//Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)

#include <stdio.h>

int main()
{
    int br, rb, h=1, k, rs, sss=0, temp;
    scanf("%d%d", &br, &rb);
    if(br<1 || rb<1){
        printf("Invalid input");}
    else{
        if(rb>br){
            temp=br;
            br=rb;
            rb=temp;
        }
    rs=br;
    while(rs>0){
        k=rs/10%10;
        rs/=100;
        sss=(k*h)+sss;
        h*=10;
        }
    if(rb==sss){
        printf("PAREN");}
    else{
        printf("NE");}
    }
    return 0;
}
