//Од стандарден влез се внесуваат два цели броја N и Х.
//Да се најде најблискот број помал од N коj е тотално различен од бројот Х.
//Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.
//Задачата да се реши без употреба на низи и матрици.

#include <stdio.h>

int main()
{
    int n, x, h, d, ks, kd, s, z, dzm, brojach;
    scanf("%d%d", &n, &x);
    for(h=n-1; h>=0; h--){
        s=x;
        d=h;
        z=0;
        dzm=0;
        brojach=0;
        while(s>0){
            ks=s%10;
            z++;
            s/=10;
            while(d>0){
                kd=d%10;
                dzm++;
                if(kd!=ks){
                    brojach++;}
                d/=10;
            }
            d=h;
        }
        if(brojach==dzm){
            printf("%d", h);
            break;
        }
    }

    return 0;
}