//Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа
//во четвртиот квадрант (-5 во примерот на сликата).Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100).
//Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.
//Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез.
//Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот.
//Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.

#include <stdio.h>

int main()
{
    int m, n, a[100][100], zolto=0, zeleno=0, sino=0, crveno=0, r, h, i, j;
    scanf("%d%d", &m, &n);
    for(i=0; i<m; i++){
        for(j=0; j<n; j++){
            scanf("%d", &a[i][j]);
        }
    }
    scanf("%d%d", &r, &h);
    for(i=0; i<m; i++){
        for(j=0; j<n; j++){
            if(i>=r && j>=h){
                crveno+=a[i][j];
            }
            if(i>=r && j<h){
                sino+=a[i][j];
            }
            if(i<r && j<h){
                zolto+=a[i][j];
            }
            if(i<r && j>=h){
                zeleno+=a[i][j];
            }
        }
    }
    printf("%d %d %d %d", zeleno, zolto, sino, crveno);

    return 0;
}
