//Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви),
//како и елементите на матрицата со димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:
//
//Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
//Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
//Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
//Променетата матрица да се испечати на екран.

#include <stdio.h>

int main()
{
    int x, m, n, i, j, k=0, zbir=0, a[100][100];
    scanf("%d%d%d", &x, &m, &n);
    for(i=0; i<m; i++){
        for(j=0; j<n; j++){
            scanf("%d", &a[i][j]);
        }
    }
    while(k<m){
        for(j=0; j<n; j++){
            zbir+=a[k][j];
        }
        if(zbir>x){
            for(j=0; j<n; j++){
                a[k][j]=1;
            }
        }
        if(zbir<x){
            for(j=0; j<n; j++){
                a[k][j]=-1;
            }
        }
        if(zbir==x){
            for(j=0; j<n; j++){
                a[k][j]=0;
            }
        }
        k++;
        zbir=0;
    }
    for(i=0; i<m; i++){
        for(j=0; j<n; j++){
            printf("%d ", a[i][j]);
        }
        printf("\n");
    }
    return 0;
}
