//Eден природен e „интересен“ ако неговиот обратен број е делив со неговиот број на цифри.
//Обратен број е бројот составен од истите цифри, но во обратен редослед (на пример, 653 е обратен број на бројот 356).
//Од тастатура се внесува природен број n ( n > 9). Да се најде и отпечати најголемиот природен број помал од n кој што е
//„интересен“. Ако внесениот број не е валиден, да се отпечати соодветна порака (Brojot ne e validen).

#include <stdio.h>

int main()
{
    int br, rb, sk, k, r=10, i, n, interesenbroj, h=0;
    scanf("%d", &n);
    if(n<10){
        printf("Brojot ne e validen");
    }
    else{
        for(br=n-1; br>0; br--){
            sk=br;
            rb=0;
            i=0;
            if(h>0) break;
            while(sk>0){
                k=sk%10;
                sk/=10;
                rb=(rb*r)+k;
                i++;
            }
            if(rb%i==0){
                printf("%d", br);
                h++;
            }
        }
    }

    return 0;
}