//Од тастатура се внесуваат димензиите на една матрица (m, n <= 100),
//а потоа и елементите од матрицата. Да се генерира низа (со најмногу m)
//така што секој елемент од низата се добива со наоѓање на елементот во секоја
//редица од матрицата што е најоддалечен од аритметичката средина во рамки на таа редица.
//Ако постојат повеќе елементи што се најоддалечени од аритметичката средина, тогаш се зема предвид првиот.
//Редоследот на запишување на елементите во низата одговара на редоследот на редиците.

#include <stdio.h>

int main()
{
    int m, n, a[100][100], zbir=0, k, i, j;
    float vrednost, h=-999, s;
    scanf("%d%d", &m, &n);
    for(i=0; i<m; i++){
        for(j=0; j<n; j++){
            scanf("%d", &a[i][j]);
        }
    }
    i=0;
    while(i<m){
        for(j=0; j<n; j++){
            zbir+=a[i][j];
        }
        vrednost=(float)zbir/n;
        for(j=0; j<n; j++){
            s=(float)a[i][j]-vrednost;
            if(s<0)
                s=s*(-1);
            if(s>h){
                h=s;
                k=a[i][j];
            }
        }
        printf("%d ", k);
        zbir=0;
        h=-9999;
        i++;
    }
    return 0;
}
