//Од стандарден влез се читаат знаци се додека не се прочита извичник.
//Во вака внесениот текст се скриени цели броеви (помали од 100).
//Да се напише програма што ќе ги прочита сите знаци и на излез ќе го испечати збирот
//на сите броеви скриени во текстот.

#include <stdio.h>

int main()
{
    char c;
    int zbir=0, broj;
    while(1){
        scanf("%c", &c);
        if(c=='!'){
            break;
        }
        if(c>='0'&&c<='9'){
            broj=c-'0';
            scanf("%c", &c);
            if(c=='!'){
                zbir+=broj;
                break;
            }
            else if(c>='0'&&c<='9'){
                broj=broj*10 + (c-'0');
                zbir+=broj;
            }
            else{
                zbir+=broj;
            }
        }
    }

    printf("%d", zbir);

    return 0;
}