//Од тастатура се внесува цел број M, а потоа M низи од цели броеви. За секоја низа прво се внесува бројот на елементи во низата N (N<=100),
//а потоа и елементите на низата.
//
//Секоја од внесените низи треба да се трансформира според следново правило:
//Ако првиот елемент од низата е позитивен број, тоа значи сите елементи од низата (вклучувајќи го и првиот)
//да се поместат за онолку места во десно, колку што е вредноста на елементот, празнините што ќе настанат во
//низата да се пополнат со елементи со вредност нула.
//
//Ако првиот елемент од низата е негативен број, тоа значи сите елементи од низата (вклучувајќи го и првиот) да се поместат
//за онолку места во лево, колку што е вредноста на елементот, празнините што ќе настанат во низата да се пополнат
//со елементи со вредност нула.
//
//При поместување на елементите, бројот на елементите во низата останува непроменет.
//На крајот да се испечатат трансформираните низи како и тоа колку од влезните низи останале празни,
//односно по трансформацијата имаат само елементи со вредност нула.
//
//Трансформацијата на низите да се реализира во посебна функција.
//Решенијата без користење функција ќе бидат оценети со најмногу 40% од поените.
//
//Објаснување на вториот и третиот пример:
//Во вториот пример се вчитува само една низа со 5 елементи (1,2,3,4,5).
//Првиот елемент е 1 (позитивен број), па елементите се поместуваат за една позиција на десно (_,1,2,3,4).
//Потоа празнините се пополнуваат со 0 и низата ги има елементите 0,1,2,3,4.
//
//Во третиот пример се вчитува исто само една низа со 5 елементи (-2,-3,-4,-5,-6).
//Првиот елемент е -2 (негативен број), па елементите се поместуваат за две позиции на лево (-4,-5,-6,_,__).
//Потоа празнините се пополнуваат со 0 и низата ги има елементите -4,-5,-6,0,0.

#include <stdio.h>

int praznaniza(int a[], int n){
    int i, temp=1;
    for(i=0; i<n; i++){
        if(a[i]!=0)
            return 0;
    }
    return 1;
}

int pozitiven(int a[], int n, int k, int h){
    int i;
    if(h==k)
        return 0;
    else
        for(i=n-1; i>=0; i--){
            a[i+1]=a[i];}
    a[0]=0;
    return pozitiven(a, n, k, h+1);
}

int negativen (int a[], int n, int k, int h){
    int i;
    if(h==k)
        return 0;
    else
        for(i=0; i<n; i++){
            a[i-1]=a[i];}
    a[n-1]=0;
    return negativen(a, n, k, h-1);
}

int main()
{
    int m, n, i, j, a[100], k, h=0, kraj=0;
    scanf("%d", &m);
    for(j=0; j<m; j++){
        scanf("%d", &n);
        for(i=0; i<n; i++){
            scanf("%d", &a[i]);
        }
        k=a[0];
        if(k>0){
            pozitiven(a, n, k, h);
        }
        else if(k<0){
            negativen(a, n, k, h);
        }
        for(i=0; i<n; i++){
            printf("%d ", a[i]);
        }
        printf("\n");
        h=0;
        kraj+=praznaniza(a, n);
    }
    printf("%d", kraj);
    return 0;
}

