//Од стандарден влез се чита природен број N (N <= 100), како и низа a[ ] од N цели броеви.
//Да се напише функција void premesti(а, n) која го преместува секој пронајден негативен број на крајот на низата.
//По преместувањето редоследот на позитивните броеви треба да остане ист како и во оригиналната низа, а истото важи и за редоследот на негативните.
//Нaпишете програма која ќе ја повика функцијата premesti за внесената низа a[ ] и потоа ќе ја испечати новодобиената низа.

#include <stdio.h>

int kraj(int a[]){
    int i;
    for(i=0; i<1000; i++){
        if(a[i]==1234567){
            return i;
        }
    }
}

void premesti(int a[]){
    int i, s=0, b[100], n;
    n=kraj(a);
    for(i=0; i<n; i++){
        if(a[i]>=0){
            b[s]=a[i];
            s++;
        }
    }
    for(i=0; i<n; i++){
        if(a[i]<0){
            b[s]=a[i];
            s++;
        }
    }
    for(i=0; i<n; i++){
        a[i]=b[i];
    }
}

int main()
{
    int n, i, a[100];
    scanf("%d", &n);
    for(i=0; i<n; i++){
        scanf("%d", &a[i]);
    }
    a[n]=1234567;
    premesti(a);
    for(i=0; i<n; i++){
        printf("%d ", a[i]);
    }
    return 0;
}