//Да се напише рекурзивна функција за наоѓање на максималната цифра од даден цел број.
//Од стандарден влез се внесуваат непознат број цели броеви се додека не се внесе нешто што не е број.
//За секој од нив да се испечати максималната цифра во посебен ред.
//
//Забелешка: Решението со рекурзивна функција носи 100% од поените, а со нерекурзивна функција 70% од поените.
//Забелешка: ЗАБРАНЕТО е користење на глобални променливи.

#include <stdio.h>

void maxcifra (int n, int max){
    int k;
    k=n%10;
    if(k>max){
        max=k;
    }
    if(n<10){
        printf("%d\n", max);
    }
    else
        return maxcifra(n/=10, max);
}

int main()
{
    int n, max=0, maxim;
    while(scanf("%d", &n)){
        maxcifra(n, max);
    }

    return 0;
}